Tekla Open API Reference for Tekla Structures 2025
BendSurface.LateralBoundary2 Property
 Gets or sets the second lateral boundary
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Point> LateralBoundary2 { get; }
Public ReadOnly Property LateralBoundary2 As List(Of Point)
	Get
Property Value
Type: List<Point>
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace